In [129]:
import numpy as np
import pandas as pd

In [130]:
dict1 ={'Name':['Tolani','Tope','Halima','Venny','Brenda',
                'Femi','Alaba'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Female','Female',
                         'Male','Male'],
                'Email':['tolani@gmail.com','tope@gmail.com',
                        'hal@gmail.com','ven@yahoo.com','brendy@hotmail.com',
                         'fm@yahoo.com','alaba@yahoo.com']}
df1=pd.DataFrame(dict1)
df1

     Name  Marks  Gender               Email
0  Tolani   98.0    Male    tolani@gmail.com
1    Tope    NaN  Female      tope@gmail.com
2  Halima   99.0  Female       hal@gmail.com
3   Venny   87.0  Female       ven@yahoo.com
4  Brenda    NaN  Female  brendy@hotmail.com
5    Femi   83.0    Male        fm@yahoo.com
6   Alaba   99.0    Male     alaba@yahoo.com

In [131]:
df2=pd.DataFrame({'Name':'Folake', 
      'Marks':88.5,
      'Email':'Folly@gmail.com',
      'Gender':'Female'},index=[0])

In [132]:
df2

     Name  Marks            Email  Gender
0  Folake   88.5  Folly@gmail.com  Female

In [133]:
pd.concat([df1,df2],ignore_index=True)

     Name  Marks  Gender               Email
0  Tolani   98.0    Male    tolani@gmail.com
1    Tope    NaN  Female      tope@gmail.com
2  Halima   99.0  Female       hal@gmail.com
3   Venny   87.0  Female       ven@yahoo.com
4  Brenda    NaN  Female  brendy@hotmail.com
5    Femi   83.0    Male        fm@yahoo.com
6   Alaba   99.0    Male     alaba@yahoo.com
7  Folake   88.5  Female     Folly@gmail.com

In [134]:
df3=pd.concat([df1,df2],ignore_index=True)

In [135]:
df3.head(3)

     Name  Marks  Gender             Email
0  Tolani   98.0    Male  tolani@gmail.com
1    Tope    NaN  Female    tope@gmail.com
2  Halima   99.0  Female     hal@gmail.com

In [136]:
df3.tail(3)

     Name  Marks  Gender            Email
5    Femi   83.0    Male     fm@yahoo.com
6   Alaba   99.0    Male  alaba@yahoo.com
7  Folake   88.5  Female  Folly@gmail.com

In [137]:
df3.head(-2)

     Name  Marks  Gender               Email
0  Tolani   98.0    Male    tolani@gmail.com
1    Tope    NaN  Female      tope@gmail.com
2  Halima   99.0  Female       hal@gmail.com
3   Venny   87.0  Female       ven@yahoo.com
4  Brenda    NaN  Female  brendy@hotmail.com
5    Femi   83.0    Male        fm@yahoo.com

In [138]:
df3.head(-3)

     Name  Marks  Gender               Email
0  Tolani   98.0    Male    tolani@gmail.com
1    Tope    NaN  Female      tope@gmail.com
2  Halima   99.0  Female       hal@gmail.com
3   Venny   87.0  Female       ven@yahoo.com
4  Brenda    NaN  Female  brendy@hotmail.com

In [139]:
df3.shape

(8, 4)

In [140]:
print("Number of rows is",df3.shape[0])

Number of rows is 8

In [141]:
print('Number of columns',df3.shape[1])

Number of columns 4

In [142]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Marks   6 non-null      float64
 2   Gender  8 non-null      object
 3   Email   8 non-null      object
dtypes: float64(1), object(3)
memory usage: 388.0+ bytes

In [143]:
df3.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [144]:
df3['Name']

0    Tolani
1      Tope
2    Halima
3     Venny
4    Brenda
5      Femi
6     Alaba
7    Folake
Name: Name, dtype: object

In [145]:
df3['Name'].unique()

array(['Tolani', 'Tope', 'Halima', 'Venny', 'Brenda', 'Femi', 'Alaba',
       'Folake'], dtype=object)

In [146]:
df3['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [147]:
df3['Gender'].nunique()

2

In [148]:
df3['Email'].unique()

array(['tolani@gmail.com', 'tope@gmail.com', 'hal@gmail.com',
       'ven@yahoo.com', 'brendy@hotmail.com', 'fm@yahoo.com',
       'alaba@yahoo.com', 'Folly@gmail.com'], dtype=object)

In [149]:
df3.nunique()

Name      8
Marks     5
Gender    2
Email     8
dtype: int64

In [150]:
df3['Gender'].value_counts()

Gender
Female    5
Male      3
Name: count, dtype: int64

In [151]:
df3['Marks'].mean()

92.41666666666667

In [152]:
df3['Marks'].fillna(92.41666666666667)

0    98.000000
1    92.416667
2    99.000000
3    87.000000
4    92.416667
5    83.000000
6    99.000000
7    88.500000
Name: Marks, dtype: float64

In [153]:
df3['Marks']=df3['Marks'].fillna(92.41666666666667)

In [154]:
df3.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [155]:
df3['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [156]:
df3['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    0
4    0
5    1
6    1
7    0
Name: Gender, dtype: int64

In [157]:
df3['New Gender']=df3['Gender'].map({'Male':1,'Female':0})

In [158]:
df3['New Gender']

0    1
1    0
2    0
3    0
4    0
5    1
6    1
7    0
Name: New Gender, dtype: int64

In [159]:
df3

     Name      Marks  Gender               Email  New Gender
0  Tolani  98.000000    Male    tolani@gmail.com           1
1    Tope  92.416667  Female      tope@gmail.com           0
2  Halima  99.000000  Female       hal@gmail.com           0
3   Venny  87.000000  Female       ven@yahoo.com           0
4  Brenda  92.416667  Female  brendy@hotmail.com           0
5    Femi  83.000000    Male        fm@yahoo.com           1
6   Alaba  99.000000    Male     alaba@yahoo.com           1
7  Folake  88.500000  Female     Folly@gmail.com           0

In [160]:
df3=df3.drop(columns='Gender')

In [161]:
df3

     Name      Marks               Email  New Gender
0  Tolani  98.000000    tolani@gmail.com           1
1    Tope  92.416667      tope@gmail.com           0
2  Halima  99.000000       hal@gmail.com           0
3   Venny  87.000000       ven@yahoo.com           0
4  Brenda  92.416667  brendy@hotmail.com           0
5    Femi  83.000000        fm@yahoo.com           1
6   Alaba  99.000000     alaba@yahoo.com           1
7  Folake  88.500000     Folly@gmail.com           0